jonahn/EE478/Lab2/PIC_SOURCES/h/p18f95j94.h
extern volatile far  unsigned char       LCDDATA57;
extern volatile far  struct {
  unsigned S08C7:1;
  unsigned S09C7:1;
  unsigned S10C7:1;
  unsigned S11C7:1;
  unsigned S12C7:1;
  unsigned S13C7:1;
  unsigned S14C7:1;
  unsigned S15C7:1;
} LCDDATA57bits;
extern volatile far  unsigned char       LCDDATA58;
extern volatile far  struct {
  unsigned S16C7:1;
  unsigned S17C7:1;
  unsigned S18C7:1;
  unsigned S19C7:1;
  unsigned S20C7:1;
  unsigned S21C7:1;
  unsigned S22C7:1;
  unsigned S23C7:1;
} LCDDATA58bits;
extern volatile far  unsigned char       LCDDATA59;
extern volatile far  struct {
  unsigned S24C7:1;
  unsigned S25C7:1;
  unsigned S26C7:1;
  unsigned S27C7:1;
  unsigned S28C7:1;
  unsigned S29C7:1;
  unsigned S30C7:1;
  unsigned S31C7:1;
} LCDDATA59bits;
extern volatile far  unsigned char       LCDDATA60;
extern volatile far  struct {
  unsigned S32C7:1;
  unsigned S33C7:1;
  unsigned S34C7:1;
  unsigned S35C7:1;
  unsigned S36C7:1;
  unsigned S37C7:1;
  unsigned S38C7:1;
  unsigned S39C7:1;
} LCDDATA60bits;
extern volatile far  unsigned char       LCDDATA61;
extern volatile far  struct {
  unsigned S40C7:1;
  unsigned S41C7:1;
  unsigned S42C7:1;
  unsigned S43C7:1;
  unsigned S44C7:1;
  unsigned S45C7:1;
  unsigned S46C7:1;
  unsigned S47C7:1;
} LCDDATA61bits;
extern volatile far  unsigned char       LCDDATA62;
extern volatile far  struct {
  unsigned S48C7:1;
  unsigned S49C7:1;
  unsigned S50C7:1;
  unsigned S51C7:1;
  unsigned S52C7:1;
  unsigned S53C7:1;
  unsigned S54C7:1;
  unsigned S55C7:1;
} LCDDATA62bits;
extern volatile far  unsigned char       LCDDATA63;
extern volatile far  struct {
  unsigned S56C7:1;
  unsigned S57C7:1;
  unsigned S58C7:1;
  unsigned S59C7:1;
  unsigned S60C7:1;
  unsigned S61C7:1;
  unsigned S62C7:1;
  unsigned S63C7:1;
} LCDDATA63bits;
extern volatile far  unsigned char       LCDSE0;
extern volatile far  struct {
  unsigned SE00:1;
  unsigned SE01:1;
  unsigned SE02:1;
  unsigned SE03:1;
  unsigned SE04:1;
  unsigned SE05:1;
  unsigned SE06:1;
  unsigned SE07:1;
} LCDSE0bits;
extern volatile far  unsigned char       LCDSE1;
extern volatile far  struct {
  unsigned SE08:1;
  unsigned SE09:1;
  unsigned SE10:1;
  unsigned SE11:1;
  unsigned SE12:1;
  unsigned SE13:1;
  unsigned SE14:1;
  unsigned SE15:1;
} LCDSE1bits;
extern volatile far  unsigned char       LCDSE2;
extern volatile far  struct {
  unsigned SE16:1;
  unsigned SE17:1;
  unsigned SE18:1;
  unsigned SE19:1;
  unsigned SE20:1;
  unsigned SE21:1;
  unsigned SE22:1;
  unsigned SE23:1;
} LCDSE2bits;
extern volatile far  unsigned char       LCDSE3;
extern volatile far  struct {
  unsigned SE24:1;
  unsigned SE25:1;
  unsigned SE26:1;
  unsigned SE27:1;
  unsigned SE28:1;
  unsigned SE29:1;
  unsigned SE30:1;
  unsigned SE31:1;
} LCDSE3bits;
extern volatile far  unsigned char       LCDSE4;
extern volatile far  struct {
  unsigned SE32:1;
  unsigned SE33:1;
  unsigned SE34:1;
  unsigned SE35:1;
  unsigned SE36:1;
  unsigned SE37:1;
  unsigned SE38:1;
  unsigned SE39:1;
} LCDSE4bits;
extern volatile far  unsigned char       LCDSE5;
extern volatile far  struct {
  unsigned SE40:1;
  unsigned SE41:1;
  unsigned SE42:1;
  unsigned SE43:1;
  unsigned SE44:1;
  unsigned SE45:1;
  unsigned SE46:1;
  unsigned SE47:1;
} LCDSE5bits;
extern volatile far  unsigned char       LCDSE6;
extern volatile far  struct {
  unsigned SE48:1;
  unsigned SE49:1;
  unsigned SE50:1;
  unsigned SE51:1;
  unsigned SE52:1;
  unsigned SE53:1;
  unsigned SE54:1;
  unsigned SE55:1;
} LCDSE6bits;
extern volatile far  unsigned char       LCDSE7;
extern volatile far  struct {
  unsigned SE56:1;
  unsigned SE57:1;
  unsigned SE58:1;
  unsigned SE59:1;
  unsigned SE60:1;
  unsigned SE61:1;
  unsigned SE62:1;
  unsigned SE63:1;
} LCDSE7bits;
extern volatile far  unsigned char       LCDRL;
extern volatile far  union {
  struct {
    unsigned LRLAT:3;
    unsigned :1;
    unsigned LRLBP:2;
    unsigned LRLAP:2;
  };
  struct {
    unsigned LRLAT0:1;
    unsigned LRLAT1:1;
    unsigned LRLAT2:1;
    unsigned :1;
    unsigned LRLBP0:1;
    unsigned LRLBP1:1;
    unsigned LRLAP0:1;
    unsigned LRLAP1:1;
  };
} LCDRLbits;
extern volatile far  unsigned char       LCDREF;
extern volatile far  union {
  struct {
    unsigned VLCD1PE:1;
    unsigned VLCD2PE:1;
    unsigned VLCD3PE:1;
    unsigned LCDCST:3;
    unsigned :1;
    unsigned LCDIRE:1;
  };
  struct {
    unsigned :3;
    unsigned LCDCST0:1;
    unsigned LCDCST1:1;
    unsigned LCDCST2:1;
  };
} LCDREFbits;
extern volatile far  unsigned char       LCDREG;
extern volatile far  union {
  struct {
    unsigned CLKSEL:2;
    unsigned MODE13:1;
    unsigned BIAS:3;
    unsigned :1;
    unsigned CPEN:1;
  };
  struct {
    unsigned CLKSEL0:1;
    unsigned CLKSEL1:1;
    unsigned :1;
    unsigned BIAS0:1;
    unsigned BIAS1:1;
    unsigned BIAS2:1;
  };
} LCDREGbits;
extern volatile far  unsigned char       LCDCON;
extern volatile far  union {
  struct {
    unsigned LMUX:3;
    unsigned CS:2;
    unsigned WERR:1;
    unsigned SLPEN:1;
    unsigned LCDEN:1;
  };
  struct {
    unsigned LMUX0:1;
    unsigned LMUX1:1;
    unsigned LMUX2:1;
    unsigned CS0:1;
    unsigned CS1:1;
  };
} LCDCONbits;
extern volatile far  unsigned char       LCDPS;
extern volatile far  union {
  struct {
    unsigned LP:4;
    unsigned WA:1;
    unsigned LCDA:1;
    unsigned BIASMD:1;
    unsigned WFT:1;
  };
  struct {
    unsigned LP0:1;
    unsigned LP1:1;
    unsigned LP2:1;
    unsigned LP3:1;
  };
} LCDPSbits;
extern volatile far  unsigned char       REFO2CON3;
extern volatile far  union {
  struct {
    unsigned RODIV:7;
  };
  struct {
    unsigned RODIV8:1;
    unsigned RODIV9:1;
    unsigned RODIV10:1;
    unsigned RODIV11:1;
    unsigned RODIV12:1;
    unsigned RODIV13:1;
    unsigned RODIV14:1;
  };
} REFO2CON3bits;
extern volatile far  unsigned char       REFO2CON2;
extern volatile far  union {
  struct {
    unsigned RODIV:8;
  };
  struct {
    unsigned RODIV0:1;
    unsigned RODIV1:1;
    unsigned RODIV2:1;
    unsigned RODIV3:1;
    unsigned RODIV4:1;
    unsigned RODIV5:1;
    unsigned RODIV6:1;
    unsigned RODIV7:1;
  };
} REFO2CON2bits;
extern volatile far  unsigned char       REFO2CON1;
extern volatile far  union {
  struct {
    unsigned ROSEL:4;
  };
  struct {
    unsigned ROSEL0:1;
    unsigned ROSEL1:1;
    unsigned ROSEL2:1;
    unsigned ROSEL3:1;
  };
} REFO2CON1bits;
extern volatile far  unsigned char       REFO2CON;
extern volatile far  struct {
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned ROSSLP:1;
  unsigned ROOE:1;
  unsigned ROSIDL:1;
  unsigned :1;
  unsigned ROON:1;
} REFO2CONbits;
extern volatile far  unsigned char       REFO1CON3;
extern volatile far  union {
  struct {
    unsigned RODIV:7;
  };
  struct {
    unsigned RODIV8:1;
    unsigned RODIV9:1;
    unsigned RODIV10:1;
    unsigned RODIV11:1;
    unsigned RODIV12:1;
    unsigned RODIV13:1;
    unsigned RODIV14:1;
  };
} REFO1CON3bits;
extern volatile far  unsigned char       REFO1CON2;
extern volatile far  union {
  struct {
    unsigned RODIV:8;
  };
  struct {
    unsigned RODIV0:1;
    unsigned RODIV1:1;
    unsigned RODIV2:1;
    unsigned RODIV3:1;
    unsigned RODIV4:1;
    unsigned RODIV5:1;
    unsigned RODIV6:1;
    unsigned RODIV7:1;
  };
} REFO1CON2bits;
extern volatile far  unsigned char       REFO1CON1;
extern volatile far  union {
  struct {
    unsigned ROSEL:4;
  };
  struct {
    unsigned ROSEL0:1;
    unsigned ROSEL1:1;
    unsigned ROSEL2:1;
    unsigned ROSEL3:1;
  };
} REFO1CON1bits;
extern volatile far  unsigned char       REFO1CON;
extern volatile far  struct {
  unsigned ACTIVE:1;
  unsigned DIVSWEN:1;
  unsigned :1;
  unsigned ROSSLP:1;
  unsigned ROOE:1;
  unsigned ROSIDL:1;
  unsigned :1;
  unsigned ROON:1;
} REFO1CONbits;
extern volatile far  unsigned char       MEMCON;
extern volatile far  union {
  struct {
    unsigned WM:2;
    unsigned :2;
    unsigned WAIT:2;
    unsigned :1;
    unsigned EBDIS:1;
  };
  struct {
    unsigned WM0:1;
    unsigned WM1:1;
    unsigned :2;
    unsigned WAIT0:1;
    unsigned WAIT1:1;
  };
} MEMCONbits;
